Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ПубликацииЭлектронныхРесурсовСУЗ/ПубликацииЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубликацииЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЭлектронногоРесурса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеКнопкиВыхода</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияКнопкиВыходаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещеныДанныеДляВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПлеерКурсовВебКабинетаСУЗ/ПлеерКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлеерКурсовВебКабинетаСУЗ</name>
  <resources>
    <name>Плеер</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ВопросыСУЗ/ВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Имя макета, которое задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементActiveX</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.СводыЗнанийСУЗ);
	
	УстановитьНачальнуюДоступностьЭлементовФормы();
	
	Список.Параметры.УстановитьЗначениеПараметра("Отсутствует", НСтр("ru = 'Отсутствует'"));
	Список.Параметры.УстановитьЗначениеПараметра("ТребуетОбновления", НСтр("ru = 'Требует обновления'"));
	Список.Параметры.УстановитьЗначениеПараметра("Актуальна", НСтр("ru = 'Актуальна'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяСтрока", "");
	Список.Параметры.УстановитьЗначениеПараметра("ЖелательноОбновить", НСтр("ru = 'Желательно обновить'"));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСущественныхИзмененийМакетов", 
		Обработки.ПубликацияЭлектронныхРесурсовСУЗ.ДатаСущественногоИзмененияМакетов());

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ШаблоныДокументов.Видимость = РазработкаСУЗКлиент.ЕстьПоддержкаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НастройкиЭлектронныхРесурсовИзменены" Тогда
		УстановитьНачальнуюДоступностьЭлементовФормы();
	КонецЕсли;
	
	Если ИмяСобытия = "ЭлектронныйРесурсЗаписан"
		ИЛИ ИмяСобытия = "ЭлектронныйРесурсОпубликован"
		ИЛИ ИмяСобытия = "НастройкиЭлектронныхРесурсовИзменены" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИспользоватьВстроенныйПлеерВебКабинета(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИспользоватьВстроенныйПлеерВебКабинетаНаСервере(ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтономныйПлеерВебКабинета(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Успех = Ложь;
	ПроведенияОбученияСоВстроеннымПлеером = Новый Массив;	
	ИспользоватьАвтономныйПлеерВебКабинетаНаСервере(ТекущиеДанные.Ссылка, Успех, ПроведенияОбученияСоВстроеннымПлеером);
	Если НЕ Успех Тогда
		ТекстВопроса = НСтр("ru = 'Для смены встроенного плеера требуется отменить или завершить проведения обучения, использующие его. Показать их?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ИспользоватьАвтономныйПлеерВебКабинетаПродолжение", ЭтотОбъект, ПроведенияОбученияСоВстроеннымПлеером);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтономныйПлеерВебКабинетаПродолжение(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка", Параметры));
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаСписка", ПараметрыФормы, ЭтотОбъект);


КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьПравоИзменения Тогда
		СтандартнаяОбработка = Ложь;
        ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.Ссылка);
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест") Тогда
		
		Подборка = ПодборкаТеста(ТекущиеДанные.Ссылка);
		
		Если ЗначениеЗаполнено(Подборка) Тогда
		
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("Ключ, ЭлектронныйРесурс", Подборка, ТекущиеДанные.Ссылка);
			ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
			Возврат;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Публикации(Команда)
	ОткрытьФорму("РегистрСведений.ПубликацииЭлектронныхРесурсовСУЗ.ФормаСписка");
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Вопросы(Команда)
	ОткрытьФорму("Справочник.ВопросыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Глоссарии(Команда)
	ОткрытьФорму("Справочник.ГлоссарииСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Подборки(Команда)
	ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страницы(Команда)
	ОткрытьФорму("Справочник.СтраницыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Термины(Команда)
	ОткрытьФорму("Справочник.ТерминыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	ОткрытьФорму("Справочник.ФайлыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Фреймы(Команда)
	ОткрытьФорму("Справочник.ФреймыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Ресурсы(Команда)
	ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Рубрикаторы(Команда)
	ОткрытьФорму("Справочник.РубрикаторыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиРесурсов(Команда)
	ОткрытьФорму("Справочник.ПоставщикиСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныКарт(Команда)
	ОткрытьФорму("Справочник.КартыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныОформления(Команда)
	ОткрытьФорму("Справочник.ШаблоныСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТекста(Команда)
	ОткрытьФорму("Справочник.ШаблоныТекстаСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныДокументов(Команда)
	ОткрытьФорму("Справочник.ШаблоныДокументовСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КонвертерВидео(Команда)
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаКонвертерВидео");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьНачальнуюДоступностьЭлементовФормы()

	Если НЕ ЕстьПравоИзменения Тогда		
		Элементы.КоманднаяПанельИнструменты.Видимость = Ложь;	
	КонецЕсли;
			
	ИспользоватьВебКабинет = ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ"); //--# КОНСТРУКТОР КУРСОВ: Заменить на ЛОЖЬ
	Элементы.ПубликацияАктуальна.Видимость = ИспользоватьВебКабинет;
	Элементы.ПубликацияОтсутствует.Видимость = ИспользоватьВебКабинет;
	Элементы.СтатусПубликации.Видимость = ИспользоватьВебКабинет;
	
	ИспользоватьВстроенныйПлеерКурсовВебКабинета = РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета();
		
	Элементы.ПлеерВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	Элементы.ВключитьПросмотрПлееромВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	Элементы.ВыключитьПросмотрПлееромВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	
	Список.Параметры.УстановитьЗначениеПараметра("Отсутствует", НСтр("ru = 'Отсутствует'"));
	Список.Параметры.УстановитьЗначениеПараметра("ТребуетОбновления", НСтр("ru = 'Требует обновления'"));
	Список.Параметры.УстановитьЗначениеПараметра("Актуальна", НСтр("ru = 'Актуальна'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяСтрока", "");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодборкаТеста(Знач ЭлектронныйРесурс)
	Возврат Справочники.СводыЗнанийСУЗ.Тест(ЭлектронныйРесурс);	
КонецФункции

&НаСервере
Процедура ИспользоватьВстроенныйПлеерВебКабинетаНаСервере(Знач ЭлектронныйРесурс)	
	РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.УстановитьИспользованиеВстроенногоПлеера(ЭлектронныйРесурс, Истина);
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьАвтономныйПлеерВебКабинетаНаСервере(Знач ЭлектронныйРесурс, Успех, ПроведенияОбученияСоВстроеннымПлеером)
	РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ОтменитьИспользованиеВстроенногоПлеера(ЭлектронныйРесурс, Успех, ПроведенияОбученияСоВстроеннымПлеером);
	Если Успех Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
